[{
  "comments": [],
  "date": "Sunday, December 13, 2015 at 7:21pm",
  "likes": "",
  "post": "Kendall Jenner and Kylie Jenner are definitely Reign's coolest relatives!",
  "poster": "Hollywood Life",
  "shares": "",
  "url": "https://www.facebook.com/HollywoodLife/?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 7:30pm",
  "likes": "",
  "post": "Are you more of a Kim or a Khloe?",
  "poster": "Glamour",
  "shares": "",
  "url": "https://www.facebook.com/glamour/?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 5, 2015 at 8:02pm",
  "likes": "",
  "post": "",
  "poster": "Riya Williams Yuyada",
  "shares": "",
  "url": "https://www.facebook.com/riya.w.yuyada?fref=nf"
}, {
  "comments": [],
  "date": "Tuesday, December 8, 2015 at 1:28pm",
  "likes": "",
  "post": "Saint West**",
  "poster": "Liz Sharpay",
  "shares": "",
  "url": "https://www.facebook.com/liz.sharpay2?fref=nf"
}, {
  "comments": [],
  "date": "Friday, December 4, 2015 at 8:12pm",
  "likes": "",
  "post": "",
  "poster": "Gary Unmarried Mugisha",
  "shares": "",
  "url": "https://www.facebook.com/garymrt"
}, {
  "comments": [],
  "date": "Friday, December 4, 2015 at 9:36am",
  "likes": "",
  "post": "SMFH",
  "poster": "Riya Williams Yuyada",
  "shares": "",
  "url": "https://www.facebook.com/riya.w.yuyada?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 6, 2015 at 12:57pm",
  "likes": "",
  "post": "Kanye West and Kim Kardashian Welcome Baby No 2 > ",
  "poster": "Ombui Charles",
  "shares": "",
  "url": "https://www.facebook.com/comacon.daily?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 5, 2015 at 8:02pm",
  "likes": "",
  "post": "Kim Kardashian and Kanye West had a baby boy  today early morning This is their baby number 2  Congratulations, you inspire alot",
  "poster": "Ritah Kaggwa",
  "shares": "",
  "url": "https://www.facebook.com/ritahlovekaggwa"
}, {
  "comments": [],
  "date": "Wednesday, December 2, 2015 at 1:24am",
  "likes": "",
  "post": "Does anyone have a gun that I can borrow  ? I am loosing the will to live. Palestine crisis Syria crisis you are having a laugh . There is no crisis in Syria or Palestine. The real Crisis is in US. Over to you Kardashian. Please help me to understand your crisis",
  "poster": "Hashim Ahmed",
  "shares": "",
  "url": "https://www.facebook.com/hashim.ahmed.75491856?fref=nf"
}, {
  "comments": [],
  "date": "Monday, November 17, 2014 at 3:44am",
  "likes": "",
  "post": "Amazing! Amazing! Amazing! Don't cheapen intimacy by turning it into short lived pleasure,don't disrespect women by objectifying them,don't cheapen beauty by perceiving it as porn. #StandOut #Speaklife #StartNow Joseph Hamilton Tamale Ngonde Nicholas Emmanuel Chalwe Joshua Chalwe Chris Simon Ndolo Kooma Benjamin Thando Sivatho Mabija Ndzana Charles Traidy Naidoo Mukiibi Isaac Isooba Jean Cedric Sserunkuuma Salim Nkululeko Zungu Ayabonga Dlova Aarav Soll Mugabi Solome Kiribakka Bakeera Sabrina Kitaka Phomolo Kopano Glow Loria Wankumbu Silengo McQuillan Moyo Maya Gcilishe Adivhaho Everest Radali Nomtha Tshwete Sinalo Snooza Mputa Mary ßléssèd Maina Ruthy Emmanuella Mwima",
  "poster": "Daniel Duke Kiyingi",
  "shares": "",
  "url": "https://www.facebook.com/daniel.kiyingi?fref=nf"
}, {
  "comments": [],
  "date": "Tuesday, December 8, 2015 at 7:30pm",
  "likes": "",
  "post": "Galz be lookin expensive, classy and Elegant. Naye nga wada ewaka omusanga ku film za Vj juniour Nga namagulu awanise mu banga!   You find her on the street walking you may think ono cousin wa kim kardashian!!??😂😂??😂😂  ‪#‎sesabat‬",
  "poster": "Sesa Bat",
  "shares": "",
  "url": "https://www.facebook.com/sesa.bat.5?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 5, 2015 at 1:15pm",
  "likes": "",
  "post": "Okay...so this girl comes to the coaching place en the excitment levels go too high....en in my head im thinking, wait, is Kim Kardashian in the house??.... en its just Sydney...mahn... ‪#‎HappyBirthdaySwthrt‬🎂🎉🎊🎁 ‪#‎HopeUHaveANycOne‬😘😘❤❤💞 👇👇👇🌟🔥💥",
  "poster": "Angel Lisa Nansubuga",
  "shares": "",
  "url": "https://www.facebook.com/angellisa.nansubuga"
}, {
  "comments": [],
  "date": "Saturday, November 28, 2015 at 10:22am",
  "likes": "",
  "post": "Oba some Ugandans be how......you get the nerve of coming into my inbox to complain mbu why am I copying you.......Ooh please clothes and shoes are put into shops for everybody to buy......as if ur Kim Kardashian or Victoria Beckham......mtsweeeeeh!",
  "poster": "Victoria Viela Nyanzi",
  "shares": "",
  "url": "https://www.facebook.com/victoria.nyanzi?fref=nf"
}, {
  "comments": [],
  "date": "Tuesday, December 8, 2015 at 5:56pm",
  "likes": "",
  "post": "Mwe buwala mwe, when your nude pics leak,(NTV's Kleith kyatuhaire, ela NTV again) save us from all that crap of I was betrayed by the one I loved n bluh bluh, you have spoiled the industry that was built on ethical values, am tired of all these bu social media attention seeking bu celebs trying to do a Kim Kardashian, this is Uganda, when your nudes leak, yes u will get media attention and some unprofessional stations(Tv n radio) will hire you, and many men will lust for u but wen all the dust settles u won't be worth 250 million USD, so pliz take a chill pill, let's groom our children to positive role models.",
  "poster": "Dee Em Es",
  "shares": "",
  "url": "https://www.facebook.com/lacapitano?fref=nf"
}, {
  "comments": [],
  "date": "Friday, September 4, 2015 at 10:40am",
  "likes": "",
  "post": "",
  "poster": "Ngabonziza Scholes M",
  "shares": "",
  "url": "https://www.facebook.com/ngabonziza.s.m"
}, {
  "comments": [],
  "date": "Saturday, October 10, 2015 at 9:26am",
  "likes": "",
  "post": "False celebrations!! And Stupid Africans. yesterday some Ugandans(Political class) celebrated 53 years of Independence. As they were celebrating in Gulu, Ugandans are dieing in Karamoja of hunger. 16 mothers die everyday in hospitals while giving birth. Every thing we use is imported even tooth picks. Police officers sleep like dogs actually a big number of them sleep in houses put up by colonialists. Suprisingly out of the 53 years, 30 years have been of NRM. When i watched ...these \"celebrations\" on TV, many questions came to my mind. By the time we gained in dependence, Uganda and  South Korea were on the same pace. Today Koreans manufacture Samsung phones, Samsung fridges, Air conditioners, LG products, hyundai cars & trucks and many unique products actually it is among the countries with the best economy in the world but our Banana Republic Uganda, the same road the queen used in 1954 from Entebbe Airport to Kampala is the same road we are using today. It's even dark during day All major construction projects in Uganda, roads, dams are being funded & executed by engineers from china not engineers from Our universities.  What independence are you talking about when Ugandans run to European &US  Embassies to seek for mighty visas in order to secure casual jobs in Europe & US and now from Europe to Middle East. Africans in Middle East are being treated like dogs.  Africans are nolonger proud of their football teams. Many Ugandans dont know that their is a football club called SC VILLA, Express etc but you find that 98% of Africans know Arsenal, Chelsea, Man U, Real Madrid.  Africans now celebrate europeans more than celebrating themselves that is  the people who went to school,now dress like Kim Kardashian, the same group cant go to national theatre and watch our local plays but they are comfortable watching soaps  from South America. If Ugandans are to gain full independence they must have a mindset shift. In the education sector, these vampires introduced free education which is  free indeed, free of knowledge and these vampires cant dare take their children to those schools because they are suspicious of this education.  Their children will be educated in the British system and American system so that their children go to UK and US. Do you guys know that Dubai City Projects started in 1991? Do you know that Emirates airlines started in 1986, the year NRM took over power as Uganda do we have any plane apart from Museveni private jet. Are we independent?  NO We are still a stone age generation. See More",
  "poster": "Frank Gashumba",
  "shares": "",
  "url": "https://www.facebook.com/frank.gashumba"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 6:37pm",
  "likes": "",
  "post": "So a woman who made a sex tape that made her \"famous\" believes she and Kanye are a divine couple? She should have been stoned !!! Not literally but in Jesus' day she would have....",
  "poster": "Gabriela Tiki Pasquier-Berry",
  "shares": "",
  "url": "https://www.facebook.com/gabby.pasquier?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 5:48pm",
  "likes": "",
  "post": "Meanwhile back at the ranch, Tonto disguised as a door.... Really mkaes you wonder the direction society is going if they take these cats seriously at all.  ",
  "poster": "Simu Lee",
  "shares": "",
  "url": "https://www.facebook.com/simu.lee.9?fref=nf"
}, {
  "comments": [],
  "date": "Thursday, December 3, 2015 at 5:04am",
  "likes": "",
  "post": "Seeing this is horrifying! See this is why guys needs to stop abusing women and stop all this domestic violence stuff because its making the whole world turn into distrupture and really dont look good at all people! And For those who likes to beat on a woman!, Give me a favor and go to a gym and beat up a real punching bag and if that .dont work mught need to go to rehab for real! I mean it. Lets stop violence too many people are getting killed from this!",
  "poster": "Hommero Williams",
  "shares": "",
  "url": "https://www.facebook.com/hommero.williams1?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 8:03pm",
  "likes": "",
  "post": "SOrry to Spam you guys but I just saw that DailyMail.com featured another one of my videos on Kim kardashian again. How fun is this?",
  "poster": "Setareh Khatibi",
  "shares": "",
  "url": "https://www.facebook.com/setareh.khatibi?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 5:57pm",
  "likes": "",
  "post": "Domestic Violence Campaign: Use of Kim Kardashian and Kendall Jenner Photos Is Illegal, Report Says Lawyers for Kim Kardashian and Kendall Jenner issued a warning to the artist behind the ‪#‎StopViolenceAgainstWomen‬ campaign, which featured the reality stars' images without permission, TMZ reporte Like the Page Faisal Inam Khan For More",
  "poster": "Faisal Inam Khan",
  "shares": "",
  "url": "https://www.facebook.com/Journalist.Faisal/?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 12, 2015 at 7:12pm",
  "likes": "",
  "post": "For all the kardashian haters.. they are human just like you.. yea they may do things we dont agree on but who cares your not perfect either so be quiet! Oh no you dont agree with my post oh booo woo delete me then!! && here is a fantastic idea if ypu dpnt care or like them stop worrying so damn much about them.",
  "poster": "Lisa Michelle",
  "shares": "",
  "url": "https://www.facebook.com/lisaivan.moreno?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 5:02pm",
  "likes": "",
  "post": "Retweeted Kim Kardashian West (@KimKardashian): We shot this tutorial using all Charlotte Tilbury make up! She is a genius! You have to see this! Go to my app! https://t.co/I6tFFeusax",
  "poster": "Paolo Paparcura",
  "shares": "",
  "url": "https://www.facebook.com/paolo.paparcura.33?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 12, 2015 at 11:12pm",
  "likes": "",
  "post": "Sign an share please, all things made of animal skin hair, needs to be burned, to ensure the world never to make these things again, never will we west use, new or old anything made from these poor animals again, make a bold statement please.",
  "poster": "Vanessa Russell",
  "shares": "",
  "url": "https://www.facebook.com/vanessa.russell.12139?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 7:48pm",
  "likes": "",
  "post": "I keep falling in love with this woman more and more!!—feeling in love.",
  "poster": "Nicolette Brady",
  "shares": "",
  "url": "https://www.facebook.com/NicoletteDuncanBrady?fref=nf"
}, {
  "comments": [],
  "date": "Wednesday, December 2, 2015 at 6:24am",
  "likes": "",
  "post": "I mean I agree that this was unethical, and that it's important that people have the right to choose to be involved...but I gotta keep it real. We're talking about people that also create their own chaos.",
  "poster": "JoAnn Soto",
  "shares": "",
  "url": "https://www.facebook.com/joann.soto.90?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 12, 2015 at 12:36pm",
  "likes": "",
  "post": "I feel like Caitlyn wants to be to transgender woman what Kim Kardashian West is to other woman, an unattainable \"inspiration\" to woman finding their niche in this world. As much as i love staged \"reality\" television and the publicity that comes with it, UGGH.",
  "poster": "Ryan Parsons",
  "shares": "",
  "url": "https://www.facebook.com/Ryan.Parsons.LOL?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 7:18pm",
  "likes": "",
  "post": "Kim Kardashian who just welcomed her second child a week ago auctions off her maternity clothes on e-bay. Kim is already on the move to get her... body back, and how best to start than creating more space in her wardrobe for some new post-baby outfits. Kim revealed her plan to followers on Twitter that she is letting go of all outfit she had on throughout the duration of her pregnancy. ' I've been saving up so many pieces from my closet for my eBay auctions! ' says Kim The reality star announced she will give out a percentage of what she make from the sales. \"A percentage' of the proceeds go to the alternative Florida VOUS Church - described as 'gatherings of 10-15 people who meet at different cafes around Miami to hang, eat, and talk about life .\" However, the world still awaits a photo of Saint West, the son of Kim Kardashian and Kanye West See More",
  "poster": "Mega Star Gossip",
  "shares": "",
  "url": "https://www.facebook.com/Mega-Star-Gossip-1620451561536371/?fref=nf"
}, {
  "comments": [],
  "date": "Saturday, December 12, 2015 at 10:18pm",
  "likes": "",
  "post": "Someone please nuke Kim and Kanye's Twitter accounts before we all die. Whoever is the last one alive is tasked with the responsibility of erasing them from history for the protection of future generations. ",
  "poster": "Portia Bettis",
  "shares": "",
  "url": "https://www.facebook.com/portia.bettis?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 1:47pm",
  "likes": "",
  "post": "Good job kim ajajajajaj i love ronda but she have a big mouth😬",
  "poster": "Janice Parrilla",
  "shares": "",
  "url": "https://www.facebook.com/milijanice.parrilla?fref=nf"
}, {
  "comments": [],
  "date": "Wednesday, December 2, 2015 at 9:57pm",
  "likes": "",
  "post": "There is more than this going on behind closed doors. ..they are the most hideous Family. ..don't know why it's not taken off the air.  A reality show, reslly?????  Come to my house,  I'll give you a big dose of reality.—thinking about making a change.",
  "poster": "Sharon Flannery",
  "shares": "",
  "url": "https://www.facebook.com/sharon.flannery.18?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 4:08am",
  "likes": "",
  "post": "You are os love and blessings god .has per his love and blessings on your life and that is a blessed form god.and your dad and his mom is looking out for you and your family with all the love they have",
  "poster": "Tammy Thompson",
  "shares": "",
  "url": "https://www.facebook.com/tammy.thompson.5876?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 3:06pm",
  "likes": "",
  "post": "ok voila le pourquoi du comment pour certaine :Ddire qui en a qui font ca tous les jours ... laisse tomber quel boulot les filles chapeau je vous admire heu lol",
  "poster": "Laura Sacha Geerts",
  "shares": "",
  "url": "https://www.facebook.com/laura.geerts.39?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 4:42pm",
  "likes": "",
  "post": "She should she shouldn't have married him to start with",
  "poster": "Kenneth Wayne Johnson",
  "shares": "",
  "url": "https://www.facebook.com/profile.php?id=100005455455403&fref=nf"
}, {
  "comments": [],
  "date": "Wednesday, December 2, 2015 at 4:44pm",
  "likes": "",
  "post": "this is disrespectful to the women who are real victims of domestic violence!!!!!!  why not post the real pictures of battered women? these ks will do anything for attention so sad!!!!",
  "poster": "Bonnie Lynne Kitterman",
  "shares": "",
  "url": "https://www.facebook.com/bonnie.kitterman?fref=nf"
}, {
  "comments": [],
  "date": "Sunday, December 13, 2015 at 6:10pm",
  "likes": "",
  "post": "Just in case anyone forgot.  Abby Shepherd hahaha",
  "poster": "Jade Shepherd",
  "shares": "",
  "url": "https://www.facebook.com/jade.smith.520?fref=nf"
}, {
  "comments": [],
  "date": "Wednesday, December 2, 2015 at 11:50pm",
  "likes": "",
  "post": "Of course they don't want their pictures being used for free, it's basically their only income as they do not have an actual talent..",
  "poster": "Vanessa Nieves Rodriguez",
  "shares": "",
  "url": "https://www.facebook.com/vanessa.nievesrodriguez?fref=nf"
}]
